app/views/users/show.html.erb

SELECT "information".* FROM "information" WHERE "information"."user_id" = ? ORDER BY "information"."id" ASC LIMIT 1  [["user_id", 1]]
---
         <td><h5>Nazione</h5></td>
         <td><h6><%= @user.information.country %><h6></td>