app/controllers/farmland_controller.rb

  def index
    @products = Product.last(6)
---
SELECT "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT 6