app/controllers/products_controller.rb

  def create
    @product = Product.create( product_params )
---
INSERT INTO "products" ("category_id", "created_at", "description", "image_url_content_type", "image_url_file_name", "image_url_file_size", "image_url_updated_at", "price", "push", "qnt", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)