app/views/products/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id %><br>
    <%= f.select :category_id, Category.all.map { |c| [c.name, c.id] }, prompt: 'Seleziona una categoria' %>